[{"username":"Erik","password":"admin","userId":0,"profilePicture":"public\\uploads\\4c113198ef888794ecbd8ed0f959ea9e","posts":[{"postContent":"Hej alla! Jag hoppas att ni har haft en fin dag. Jag har precis avslutat en promenad i parken. Det var så härligt att känna solen på ansiktet och få frisk luft. Vad har ni för er idag?","postId":0,"comments":[{"username":"johanna","comment":"Vilken fin dag du haft! Jag älskar också att gå på promenader i parken."},{"username":"karl","comment":"Så härligt att höra! Jag har varit ute och fått lite frisk luft också."}]},{"postContent":"Tänkte på gamla tider när vi samlades för kaffe varje eftermiddag. Det var alltid så trevligt att prata och skratta tillsammans. Är det någon här som minns dessa stunder?","postId":1,"comments":[{"username":"steven","comment":"Very good post!"},{"username":"ellen","comment":"Ja, de stunderna var fantastiska! Jag saknar dem också."},{"username":"anna","comment":"Så fina minnen! Vi borde kanske göra något liknande snart."}]},{"postContent":"Hej hej hej!","postId":21}],"friends":[2,4]},{"username":"daw","password":"dwa","userId":2,"profilePicture":"","posts":[{"postContent":"Min katt har precis fått sina första kattungar! Jag är så lycklig! Har någon av er haft kattungar förut?","postId":2,"comments":[{"username":"anna","comment":"Åh, så underbart! Jag älskar kattungar. Jag har haft några tidigare."},{"username":"britt","comment":"Grattis till kattmamman! Hoppas alla kattungarna mår bra."}]}],"friends":[0,4,5]},{"username":"steven","password":"stev","userId":3,"profilePicture":"","posts":[{"postContent":"Sitter och funderar på gamla resor. En av mina favoritresor var till Italien. Någon här som har varit där?","postId":3,"comments":[{"username":"admin","comment":"Italien är fantastiskt! Har varit där flera gånger. Vad var ditt favoritställe?"},{"username":"lisa","comment":"Jag älskar Italien! Jag minns en resa till Rom, det var helt magiskt."}]}],"friends":[5]},{"username":"ellen","password":"ellen123","userId":4,"profilePicture":"","posts":[{"postContent":"Jag började nyligen sticka igen. Det är så avkopplande! Vad tycker ni om att sticka?","postId":4,"comments":[{"username":"admin","comment":"Jag har också börjat sticka igen. Det är en fin hobby, väldigt avslappnande!"},{"username":"johanna","comment":"Jag älskar att sticka! Har gjort många halsdukar och tröjor."}]}],"friends":[0,2,5]},{"username":"karl","password":"karlpass","userId":5,"profilePicture":"","posts":[{"postContent":"Idag har jag planterat några blommor i trädgården. Jag älskar att ta hand om mina växter. Vad odlar ni i era trädgårdar?","postId":5,"comments":[{"username":"britt","comment":"Jag har också en trädgård och älskar att plantera rosor. Så fint att se dem växa!"},{"username":"ellen","comment":"Så härligt! Jag odlar tomater och örter, det är så roligt att se dem växa."}]}],"friends":[2,3,4]}]